# Terraform `environment` `test`
#### Initialization ⚙️`success`
#### Format and Style 🖌`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPWNjNmI1ODg2LTM2YWYtNGQ1NC05ZDMwLTFiMGZmZmM3MzZkODt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.aks.azurerm_kubernetes_cluster.aks has been deleted
  - resource "azurerm_kubernetes_cluster" "aks" {
      - id                                  = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-aks-rg/providers/Microsoft.ContainerService/managedClusters/corr-at22-aks" -> null
      - kube_admin_config                   = (sensitive value) -> null
      - kube_config                         = (sensitive value) -> null
      - name                                = "corr-at22-aks" -> null
      - node_resource_group                 = "MC_corr-at22-aks-rg_corr-at22-aks_norwayeast" -> null
      - oidc_issuer_url                     = "https://norwayeast.oic.prod-aks.azure.com/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/fdadcd39-4643-46c0-a3f4-34d0e7a7c6f2/" -> null
        # (31 unchanged attributes hidden)

      - identity {
          - principal_id = "f1afac45-5f44-439d-9dac-7ae3bf6b7d4e" -> null
          - tenant_id    = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c" -> null
          - type         = "SystemAssigned" -> null
        }

      - kubelet_identity {
          - client_id                 = "e14af846-e42a-4e8f-94e8-f97c60da116d" -> null
          - object_id                 = "9c7c79d6-a990-4ebe-b8d0-b9a6e957cf68" -> null
          - user_assigned_identity_id = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/MC_corr-at22-aks-rg_corr-at22-aks_norwayeast/providers/Microsoft.ManagedIdentity/userAssignedIdentities/corr-at22-aks-agentpool" -> null
        }

        # (9 unchanged blocks hidden)
    }

  # module.aks.azurerm_log_analytics_workspace.aks has been deleted
  - resource "azurerm_log_analytics_workspace" "aks" {
      - id                                      = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-monitor-rg/providers/Microsoft.OperationalInsights/workspaces/corr-at22-aks-law" -> null
      - name                                    = "corr-at22-aks-law" -> null
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.aks.azurerm_monitor_data_collection_rule.law has been deleted
  - resource "azurerm_monitor_data_collection_rule" "law" {
      - id                          = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-monitor-rg/providers/Microsoft.Insights/dataCollectionRules/corr-at22-aks-law-mdcr" -> null
        name                        = "corr-at22-aks-law-mdcr"
        # (6 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.aks.azurerm_public_ip.pip4 has been deleted
  - resource "azurerm_public_ip" "pip4" {
        id                      = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/MC_corr-at22-aks-rg_corr-at22-aks_norwayeast/providers/Microsoft.Network/publicIPAddresses/corr-at22-aks-pip4"
      - ip_address              = "20.251.180.36" -> null
        name                    = "corr-at22-aks-pip4"
        # (14 unchanged attributes hidden)
    }

  # module.aks.azurerm_public_ip.pip6 has been deleted
  - resource "azurerm_public_ip" "pip6" {
        id                      = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/MC_corr-at22-aks-rg_corr-at22-aks_norwayeast/providers/Microsoft.Network/publicIPAddresses/corr-at22-aks-pip6"
      - ip_address              = "2603:1020:e01:13::6c" -> null
        name                    = "corr-at22-aks-pip6"
        # (14 unchanged attributes hidden)
    }

  # module.aks.azurerm_public_ip_prefix.prefix4 has been deleted
  - resource "azurerm_public_ip_prefix" "prefix4" {
      - id                  = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-aks-rg/providers/Microsoft.Network/publicIPPrefixes/corr-at22-aks-prefix4" -> null
        name                = "corr-at22-aks-prefix4"
        # (9 unchanged attributes hidden)
    }

  # module.aks.azurerm_public_ip_prefix.prefix6 has been deleted
  - resource "azurerm_public_ip_prefix" "prefix6" {
      - id                  = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-aks-rg/providers/Microsoft.Network/publicIPPrefixes/corr-at22-aks-prefix6" -> null
        name                = "corr-at22-aks-prefix6"
        # (9 unchanged attributes hidden)
    }

  # module.aks.azurerm_resource_group.aks has been deleted
  - resource "azurerm_resource_group" "aks" {
      - id         = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-aks-rg" -> null
      - location   = "norwayeast" -> null
      - name       = "corr-at22-aks-rg" -> null
        # (1 unchanged attribute hidden)
    }

  # module.aks.azurerm_resource_group.dis has been deleted
  - resource "azurerm_resource_group" "dis" {
      - id         = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/DIS_corr-at22_main-rg" -> null
        name       = "DIS_corr-at22_main-rg"
        # (2 unchanged attributes hidden)
    }

  # module.aks.azurerm_resource_group.monitor has been deleted
  - resource "azurerm_resource_group" "monitor" {
        id         = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-monitor-rg"
      - location   = "norwayeast" -> null
      - name       = "corr-at22-monitor-rg" -> null
        # (1 unchanged attribute hidden)
    }

  # module.aks.azurerm_storage_account.aks_log has been deleted
  - resource "azurerm_storage_account" "aks_log" {
      - id                                 = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-monitor-rg/providers/Microsoft.Storage/storageAccounts/corrat22akslog61cd84" -> null
        name                               = "corrat22akslog61cd84"
        # (97 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.aks.azurerm_subnet.aks["aks_syspool"] has been deleted
  - resource "azurerm_subnet" "aks" {
      - id                                            = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-aks-rg/providers/Microsoft.Network/virtualNetworks/corr-at22-aks-vnet/subnets/aks_syspool" -> null
        name                                          = "aks_syspool"
        # (6 unchanged attributes hidden)
    }

  # module.aks.azurerm_subnet.aks["aks_workpool"] has been deleted
  - resource "azurerm_subnet" "aks" {
      - id                                            = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-aks-rg/providers/Microsoft.Network/virtualNetworks/corr-at22-aks-vnet/subnets/aks_workpool" -> null
        name                                          = "aks_workpool"
        # (6 unchanged attributes hidden)
    }

  # module.aks.azurerm_virtual_network.aks has been deleted
  - resource "azurerm_virtual_network" "aks" {
        id                             = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-aks-rg/providers/Microsoft.Network/virtualNetworks/corr-at22-aks-vnet"
      - name                           = "corr-at22-aks-vnet" -> null
        # (10 unchanged attributes hidden)
    }

  # module.azure_service_operator.azurerm_resource_group.aso_rg has been deleted
  - resource "azurerm_resource_group" "aso_rg" {
        id         = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/aso-corr-at22-rg"
      - location   = "norwayeast" -> null
      - name       = "aso-corr-at22-rg" -> null
        # (1 unchanged attribute hidden)
    }

  # module.azure_service_operator.azurerm_role_definition.user_assigned_identity_role has been deleted
  - resource "azurerm_role_definition" "user_assigned_identity_role" {
        id                          = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/providers/Microsoft.Authorization/roleDefinitions/9f18e899-c8a0-3ed8-861b-5491f36fadc5|/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/DIS_corr-at22_main-rg"
        name                        = "dis-identity-admin-corr-at22"
      - role_definition_resource_id = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/providers/Microsoft.Authorization/roleDefinitions/9f18e899-c8a0-3ed8-861b-5491f36fadc5" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.azure_service_operator.azurerm_user_assigned_identity.aso_identity has been deleted
  - resource "azurerm_user_assigned_identity" "aso_identity" {
      - client_id           = "a8a4e47a-c2bb-4dad-b4fc-e242dfade6f9" -> null
      - id                  = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/aso-corr-at22-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aso-identity-corr-at22" -> null
        name                = "aso-identity-corr-at22"
      - principal_id        = "eeeee1b8-e383-4ed9-b320-b6e458c738d3" -> null
      - tenant_id           = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c" -> null
        # (2 unchanged attributes hidden)
    }

  # module.observability.azurerm_application_insights.obs has been deleted
  - resource "azurerm_application_insights" "obs" {
      - connection_string                     = (sensitive value) -> null
      - id                                    = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-obs-rg/providers/Microsoft.Insights/components/corr-at22-obs-appinsights" -> null
        name                                  = "corr-at22-obs-appinsights"
        # (15 unchanged attributes hidden)
    }

  # module.observability.azurerm_key_vault.obs_kv has been deleted
  - resource "azurerm_key_vault" "obs_kv" {
      - id                              = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-obs-rg/providers/Microsoft.KeyVault/vaults/obs-corr-at22-B5W6pl" -> null
        name                            = "obs-corr-at22-B5W6pl"
      - vault_uri                       = "https://obs-corr-at22-b5w6pl.vault.azure.net/" -> null
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.observability.azurerm_log_analytics_workspace.obs has been deleted
  - resource "azurerm_log_analytics_workspace" "obs" {
      - id                                      = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-obs-rg/providers/Microsoft.OperationalInsights/workspaces/corr-at22-obs-law" -> null
        name                                    = "corr-at22-obs-law"
        # (16 unchanged attributes hidden)
    }

  # module.observability.azurerm_monitor_data_collection_endpoint.amw[0] has been deleted
  - resource "azurerm_monitor_data_collection_endpoint" "amw" {
      - id                            = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-obs-rg/providers/Microsoft.Insights/dataCollectionEndpoints/corr-at22-obs-amw-mdce" -> null
        name                          = "corr-at22-obs-amw-mdce"
        # (9 unchanged attributes hidden)
    }

  # module.observability.azurerm_monitor_data_collection_rule.amw[0] has been deleted
  - resource "azurerm_monitor_data_collection_rule" "amw" {
      - id                          = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-obs-rg/providers/Microsoft.Insights/dataCollectionRules/corr-at22-obs-amw-mdcr" -> null
        name                        = "corr-at22-obs-amw-mdcr"
        # (6 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.observability.azurerm_monitor_workspace.obs has been deleted
  - resource "azurerm_monitor_workspace" "obs" {
      - id                                  = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-obs-rg/providers/Microsoft.Monitor/accounts/corr-at22-obs-amw" -> null
      - name                                = "corr-at22-obs-amw" -> null
        # (6 unchanged attributes hidden)
    }

  # module.observability.azurerm_resource_group.obs has been deleted
  - resource "azurerm_resource_group" "obs" {
        id         = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/resourceGroups/corr-at22-obs-rg"
      - location   = "norwayeast" -> null
      - name       = "corr-at22-obs-rg" -> null
        # (1 unchanged attribute hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.aks.azurerm_kubernetes_cluster.aks will be created
  + resource "azurerm_kubernetes_cluster" "aks" {
      + automatic_upgrade_channel           = "patch"
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "corr-at22"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.32"
      + location                            = "norwayeast"
      + name                                = "corr-at22-aks"
      + node_os_upgrade_channel             = "NodeImage"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_enabled                 = true
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + resource_group_name                 = "corr-at22-aks-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + workload_identity_enabled           = true

      + auto_scaler_profile (known after apply)

      + azure_active_directory_role_based_access_control {
          + admin_group_object_ids = [
              + "09599a84-645b-4217-853f-01700a17cd4a",
            ]
          + azure_rbac_enabled     = true
          + tenant_id              = (known after apply)
        }

      + default_node_pool {
          + auto_scaling_enabled         = true
          + kubelet_disk_type            = (known after apply)
          + max_count                    = 6
          + max_pods                     = 200
          + min_count                    = 1
          + name                         = "syspool"
          + node_count                   = 1
          + node_labels                  = (known after apply)
          + only_critical_addons_enabled = true
          + orchestrator_version         = "1.32"
          + os_disk_size_gb              = (known after apply)
          + os_disk_type                 = "Managed"
          + os_sku                       = "AzureLinux"
          + scale_down_mode              = "Delete"
          + temporary_name_for_rotation  = "syspool99"
          + type                         = "VirtualMachineScaleSets"
          + ultra_ssd_enabled            = false
          + vm_size                      = "standard_b2s_v2"
          + vnet_subnet_id               = (known after apply)
          + workload_runtime             = (known after apply)
          + zones                        = [
              + "1",
              + "2",
              + "3",
            ]

          + upgrade_settings {
              + max_surge = "10%"
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + kubelet_identity (known after apply)

      + maintenance_window_auto_upgrade {
          + day_of_week = "Monday"
          + duration    = 5
          + frequency   = "Weekly"
          + interval    = 1
          + start_date  = (known after apply)
          + start_time  = "23:30"
          + utc_offset  = "+00:00"
        }

      + maintenance_window_node_os {
          + day_of_week = "Tuesday"
          + duration    = 5
          + frequency   = "Weekly"
          + interval    = 1
          + start_date  = (known after apply)
          + start_time  = "23:30"
          + utc_offset  = "+00:00"
        }

      + monitor_metrics {}

      + network_profile {
          + dns_service_ip      = "10.250.0.10"
          + ip_versions         = [
              + "IPv4",
              + "IPv6",
            ]
          + load_balancer_sku   = "standard"
          + network_data_plane  = "azure"
          + network_mode        = (known after apply)
          + network_plugin      = "azure"
          + network_plugin_mode = "overlay"
          + network_policy      = (known after apply)
          + outbound_type       = "loadBalancer"
          + pod_cidr            = (known after apply)
          + pod_cidrs           = [
              + "10.240.0.0/16",
              + "fd10:59f0:8c79:240::/64",
            ]
          + service_cidr        = (known after apply)
          + service_cidrs       = [
              + "10.250.0.0/24",
              + "fd10:59f0:8c79:250::/108",
            ]

          + load_balancer_profile {
              + backend_pool_type           = "NodeIPConfiguration"
              + effective_outbound_ips      = (known after apply)
              + idle_timeout_in_minutes     = 30
              + managed_outbound_ip_count   = (known after apply)
              + managed_outbound_ipv6_count = (known after apply)
              + outbound_ip_prefix_ids      = (known after apply)
              + outbound_ports_allocated    = 0
            }

          + nat_gateway_profile (known after apply)
        }

      + oms_agent {
          + log_analytics_workspace_id      = (known after apply)
          + msi_auth_for_monitoring_enabled = true
          + oms_agent_identity              = (known after apply)
        }

      + windows_profile (known after apply)
    }

  # module.aks.azurerm_kubernetes_cluster_extension.flux will be created
  + resource "azurerm_kubernetes_cluster_extension" "flux" {
      + aks_assigned_identity  = (known after apply)
      + cluster_id             = (known after apply)
      + configuration_settings = {
          + "autoUpgradeMinorVersion" = "true"
          + "multiTenancy.enforce"    = "false"
          + "useKubeletIdentity"      = "true"
        }
      + current_version        = (known after apply)
      + extension_type         = "microsoft.flux"
      + id                     = (known after apply)
      + name                   = "flux"
      + release_namespace      = (known after apply)
      + release_train          = (known after apply)
      + target_namespace       = (known after apply)
    }

  # module.aks.azurerm_kubernetes_cluster_node_pool.workpool will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "workpool" {
      + auto_scaling_enabled  = true
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 6
      + max_pods              = 200
      + min_count             = 0
      + mode                  = "User"
      + name                  = "workpool"
      + node_count            = 0
      + node_labels           = (known after apply)
      + orchestrator_version  = "1.32"
      + os_disk_size_gb       = (known after apply)
      + os_disk_type          = "Managed"
      + os_sku                = "AzureLinux"
      + os_type               = "Linux"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + ultra_ssd_enabled     = false
      + vm_size               = "standard_b2s_v2"
      + vnet_subnet_id        = (known after apply)
      + zones                 = [
          + "1",
          + "2",
          + "3",
        ]

      + upgrade_settings {
          + max_surge = "10%"
        }
    }

  # module.aks.azurerm_log_analytics_workspace.aks will be created
  + resource "azurerm_log_analytics_workspace" "aks" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = (known after apply)
      + local_authentication_enabled    = (known after apply)
      + location                        = "norwayeast"
      + name                            = "corr-at22-aks-law"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "corr-at22-monitor-rg"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = (known after apply)
      + workspace_id                    = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.aks.azurerm_monitor_data_collection_rule.law will be created
  + resource "azurerm_monitor_data_collection_rule" "law" {
      + description         = "DCR for Azure Monitor Container Insights"
      + id                  = (known after apply)
      + immutable_id        = (known after apply)
      + location            = "norwayeast"
      + name                = "corr-at22-aks-law-mdcr"
      + resource_group_name = "corr-at22-monitor-rg"

      + data_flow {
          + destinations = [
              + "corr-at22-aks-law",
            ]
          + streams      = [
              + "Microsoft-ContainerLog",
              + "Microsoft-ContainerLogV2",
              + "Microsoft-KubeEvents",
              + "Microsoft-KubePodInventory",
            ]
        }
      + data_flow {
          + destinations = [
              + "corr-at22-aks-law",
            ]
          + streams      = [
              + "Microsoft-Syslog",
            ]
        }

      + data_sources {
          + extension {
              + extension_json = jsonencode(
                    {
                      + dataCollectionSettings = {
                          + enableContainerLogV2    = true
                          + interval                = "5m"
                          + log_collection_settings = {
                              + collect_all_kube_events = {
                                  + enabled = false
                                }
                              + enrich_container_logs   = {
                                  + enabled = false
                                }
                              + env_var                 = {
                                  + enabled = false
                                }
                              + stderr                  = {
                                  + enabled            = true
                                  + exclude_namespaces = [
                                      + "kube-system",
                                      + "monitoring",
                                    ]
                                }
                              + stdout                  = {
                                  + enabled            = false
                                  + exclude_namespaces = [
                                      + "kube-system",
                                    ]
                                }
                            }
                          + namespaceFilteringMode  = "Exclude"
                          + namespaces              = [
                              + "kube-system",
                              + "gatekeeper-system",
                              + "azure-arc",
                            ]
                        }
                    }
                )
              + extension_name = "ContainerInsights"
              + name           = "ContainerInsightsExtension"
              + streams        = [
                  + "Microsoft-ContainerLog",
                  + "Microsoft-ContainerLogV2",
                  + "Microsoft-KubeEvents",
                  + "Microsoft-KubePodInventory",
                ]
            }
          + syslog {
              + facility_names = [
                  + "auth",
                  + "authpriv",
                  + "cron",
                  + "daemon",
                  + "mark",
                  + "kern",
                  + "local0",
                  + "local1",
                  + "local2",
                  + "local3",
                  + "local4",
                  + "local5",
                  + "local6",
                  + "local7",
                  + "lpr",
                  + "mail",
                  + "news",
                  + "syslog",
                  + "user",
                  + "uucp",
                ]
              + log_levels     = [
                  + "Error",
                  + "Critical",
                  + "Alert",
                  + "Emergency",
                ]
              + name           = "sysLogsDataSource"
              + streams        = [
                  + "Microsoft-Syslog",
                ]
            }
        }

      + destinations {
          + log_analytics {
              + name                  = "corr-at22-aks-law"
              + workspace_resource_id = (known after apply)
            }
        }
    }

  # module.aks.azurerm_monitor_data_collection_rule_association.law will be created
  + resource "azurerm_monitor_data_collection_rule_association" "law" {
      + data_collection_rule_id = (known after apply)
      + description             = "Association of container insights data collection rule. Deleting this association will break the data collection for this AKS Cluster."
      + id                      = (known after apply)
      + name                    = "corr-at22-aks-law-mdcra"
      + target_resource_id      = (known after apply)
    }

  # module.aks.azurerm_monitor_diagnostic_setting.aks will be created
  + resource "azurerm_monitor_diagnostic_setting" "aks" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + name                           = "AKS-Diagnostics"
      + storage_account_id             = (known after apply)
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category       = "kube-audit-admin"
            # (1 unchanged attribute hidden)
        }

      + enabled_metric {
          + category = "AllMetrics"
        }

      + metric (known after apply)
    }

  # module.aks.azurerm_public_ip.pip4 will be created
  + resource "azurerm_public_ip" "pip4" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + domain_name_label       = "corr-at22"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "norwayeast"
      + name                    = "corr-at22-aks-pip4"
      + resource_group_name     = (known after apply)
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + zones                   = [
          + "1",
          + "2",
          + "3",
        ]
    }

  # module.aks.azurerm_public_ip.pip6 will be created
  + resource "azurerm_public_ip" "pip6" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + domain_name_label       = "corr-at22"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv6"
      + location                = "norwayeast"
      + name                    = "corr-at22-aks-pip6"
      + resource_group_name     = (known after apply)
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + zones                   = [
          + "1",
          + "2",
          + "3",
        ]
    }

  # module.aks.azurerm_public_ip_prefix.prefix4 will be created
  + resource "azurerm_public_ip_prefix" "prefix4" {
      + id                  = (known after apply)
      + ip_prefix           = (known after apply)
      + ip_version          = "IPv4"
      + location            = "norwayeast"
      + name                = "corr-at22-aks-prefix4"
      + prefix_length       = 31
      + resource_group_name = "corr-at22-aks-rg"
      + sku                 = "Standard"
      + sku_tier            = "Regional"
      + zones               = [
          + "1",
          + "2",
          + "3",
        ]
    }

  # module.aks.azurerm_public_ip_prefix.prefix6 will be created
  + resource "azurerm_public_ip_prefix" "prefix6" {
      + id                  = (known after apply)
      + ip_prefix           = (known after apply)
      + ip_version          = "IPv6"
      + location            = "norwayeast"
      + name                = "corr-at22-aks-prefix6"
      + prefix_length       = 127
      + resource_group_name = "corr-at22-aks-rg"
      + sku                 = "Standard"
      + sku_tier            = "Regional"
      + zones               = [
          + "1",
          + "2",
          + "3",
        ]
    }

  # module.aks.azurerm_resource_group.aks will be created
  + resource "azurerm_resource_group" "aks" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "corr-at22-aks-rg"
    }

  # module.aks.azurerm_resource_group.dis will be created
  + resource "azurerm_resource_group" "dis" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "DIS_corr-at22_main-rg"
    }

  # module.aks.azurerm_resource_group.monitor will be created
  + resource "azurerm_resource_group" "monitor" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "corr-at22-monitor-rg"
    }

  # module.aks.azurerm_role_assignment.aks_acrpull["/subscriptions/a6e9ee7d-2b65-41e1-adfb-0c8c23515cf9/resourceGroups/acr/providers/Microsoft.ContainerRegistry/registries/altinncr"] must be replaced
-/+ resource "azurerm_role_assignment" "aks_acrpull" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/a6e9ee7d-2b65-41e1-adfb-0c8c23515cf9/resourceGroups/acr/providers/Microsoft.ContainerRegistry/registries/altinncr/providers/Microsoft.Authorization/roleAssignments/91dc4040-9a6e-f1ba-916e-d9e29ab5a5b4" -> (known after apply)
      ~ name                                   = "91dc4040-9a6e-f1ba-916e-d9e29ab5a5b4" -> (known after apply)
      ~ principal_id                           = "9c7c79d6-a990-4ebe-b8d0-b9a6e957cf68" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/a6e9ee7d-2b65-41e1-adfb-0c8c23515cf9/providers/Microsoft.Authorization/roleDefinitions/7f951dda-4ed3-4680-a7ca-43fe172d538d" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.aks.azurerm_role_assignment.network_contributor will be created
  + resource "azurerm_role_assignment" "network_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # module.aks.azurerm_storage_account.aks_log will be created
  + resource "azurerm_storage_account" "aks_log" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = true
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "norwayeast"
      + min_tls_version                    = "TLS1_2"
      + name                               = "corrat22akslog61cd84"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = false
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "corr-at22-monitor-rg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = false
      + table_encryption_key_type          = "Service"

      + blob_properties (known after apply)

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Deny"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.aks.azurerm_subnet.aks["aks_syspool"] will be created
  + resource "azurerm_subnet" "aks" {
      + address_prefixes                              = [
          + "fd96:20bf:3235:1::/64",
          + "10.203.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "aks_syspool"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "corr-at22-aks-rg"
      + virtual_network_name                          = "corr-at22-aks-vnet"
    }

  # module.aks.azurerm_subnet.aks["aks_workpool"] will be created
  + resource "azurerm_subnet" "aks" {
      + address_prefixes                              = [
          + "fd96:20bf:3235:2::/64",
          + "10.203.2.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "aks_workpool"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "corr-at22-aks-rg"
      + virtual_network_name                          = "corr-at22-aks-vnet"
    }

  # module.aks.azurerm_virtual_network.aks will be created
  + resource "azurerm_virtual_network" "aks" {
      + address_space                  = [
          + "10.203.0.0/20",
          + "fd96:20bf:3235::/56",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "norwayeast"
      + name                           = "corr-at22-aks-vnet"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "corr-at22-aks-rg"
      + subnet                         = (known after apply)
    }

  # module.azure_service_operator.azapi_resource.aso will be created
  + resource "azapi_resource" "aso" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + aso = {
                      + force                  = false
                      + path                   = "./"
                      + postBuild              = {
                          + substitute = {
                              + AZURE_CLIENT_ID       = (known after apply)
                              + AZURE_SUBSCRIPTION_ID = "cc6b5886-36af-4d54-9d30-1b0fffc736d8"
                              + AZURE_TENANT_ID       = (known after apply)
                              + CRD_PATTERN           = "managedidentity.azure.com/*;authorization.azure.com/*"
                            }
                        }
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring2"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/azure-service-operator"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = (known after apply)
      + name                      = "azure-service-operator"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + tags                      = (known after apply)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.azure_service_operator.azurerm_federated_identity_credential.aso_fic will be created
  + resource "azurerm_federated_identity_credential" "aso_fic" {
      + audience            = [
          + "api://AzureADTokenExchange",
        ]
      + id                  = (known after apply)
      + issuer              = (known after apply)
      + name                = "aso-aks-corr-at22"
      + parent_id           = (known after apply)
      + resource_group_name = "aso-corr-at22-rg"
      + subject             = "system:serviceaccount:azureserviceoperator-system:azureserviceoperator-system"
    }

  # module.azure_service_operator.azurerm_resource_group.aso_rg will be created
  + resource "azurerm_resource_group" "aso_rg" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "aso-corr-at22-rg"
    }

  # module.azure_service_operator.azurerm_role_assignment.aso_contrib_role_assignment will be created
  + resource "azurerm_role_assignment" "aso_contrib_role_assignment" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.azure_service_operator.azurerm_role_definition.user_assigned_identity_role will be created
  + resource "azurerm_role_definition" "user_assigned_identity_role" {
      + assignable_scopes           = (known after apply)
      + description                 = "Role for Dis deployed Azure Service Operator to manage resources in the specified resource group."
      + id                          = (known after apply)
      + name                        = "dis-identity-admin-corr-at22"
      + role_definition_id          = (known after apply)
      + role_definition_resource_id = (known after apply)
      + scope                       = (known after apply)

      + permissions {
          + actions     = [
              + "Microsoft.ManagedIdentity/userAssignedIdentities/read",
              + "Microsoft.ManagedIdentity/userAssignedIdentities/write",
              + "Microsoft.ManagedIdentity/userAssignedIdentities/delete",
              + "Microsoft.ManagedIdentity/userAssignedIdentities/federatedIdentityCredentials/read",
              + "Microsoft.ManagedIdentity/userAssignedIdentities/federatedIdentityCredentials/write",
              + "Microsoft.ManagedIdentity/userAssignedIdentities/federatedIdentityCredentials/delete",
              + "Microsoft.ManagedIdentity/userAssignedIdentities/revokeTokens/action",
              + "Microsoft.Authorization/*/read",
            ]
          + not_actions = []
        }
    }

  # module.azure_service_operator.azurerm_user_assigned_identity.aso_identity will be created
  + resource "azurerm_user_assigned_identity" "aso_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "norwayeast"
      + name                = "aso-identity-corr-at22"
      + principal_id        = (known after apply)
      + resource_group_name = "aso-corr-at22-rg"
      + tenant_id           = (known after apply)
    }

  # module.grafana.azurerm_dashboard_grafana.grafana will be created
  + resource "azurerm_dashboard_grafana" "grafana" {
      + api_key_enabled                        = true
      + auto_generated_domain_name_label_scope = "TenantReuse"
      + deterministic_outbound_ip_enabled      = true
      + endpoint                               = (known after apply)
      + grafana_major_version                  = "11"
      + grafana_version                        = (known after apply)
      + id                                     = (known after apply)
      + location                               = "norwayeast"
      + name                                   = "grafana-corr-at22"
      + outbound_ip                            = (known after apply)
      + public_network_access_enabled          = true
      + resource_group_name                    = "grafana-corr-at22-rg"
      + sku                                    = "Standard"
      + zone_redundancy_enabled                = false

      + azure_monitor_workspace_integrations {
          + resource_id = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.grafana.azurerm_resource_group.grafana will be created
  + resource "azurerm_resource_group" "grafana" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "grafana-corr-at22-rg"
    }

  # module.grafana.azurerm_role_assignment.amw_datareaderrole["default-obs-workspace"] will be created
  + resource "azurerm_role_assignment" "amw_datareaderrole" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.grafana.azurerm_role_assignment.grafana_admin["143ed28a-6e6d-4ca0-8273-eecb9c1665ba"] will be created
  + resource "azurerm_role_assignment" "grafana_admin" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "143ed28a-6e6d-4ca0-8273-eecb9c1665ba"
      + principal_type                   = "Group"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # module.grafana.azurerm_role_assignment.grafana_admin_sp will be created
  + resource "azurerm_role_assignment" "grafana_admin_sp" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "cc75a1cc-d6a1-4530-828f-86832ce91b9b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # module.grafana.azurerm_role_assignment.grafana_editor["416302ed-fbab-41a4-8c8d-61f486fa79ca"] will be created
  + resource "azurerm_role_assignment" "grafana_editor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "416302ed-fbab-41a4-8c8d-61f486fa79ca"
      + principal_type                   = "Group"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Editor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # module.grafana.azurerm_role_assignment.grafana_permission["cc6b5886-36af-4d54-9d30-1b0fffc736d8"] will be created
  + resource "azurerm_role_assignment" "grafana_permission" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8"
      + skip_service_principal_aad_check = true
    }

  # module.grafana.grafana_service_account.admin will be created
  + resource "grafana_service_account" "admin" {
      + id          = (known after apply)
      + is_disabled = false
      + name        = "admin-service-account"
      + role        = "Admin"
    }

  # module.grafana.grafana_service_account_token.grafana_operator will be created
  + resource "grafana_service_account_token" "grafana_operator" {
      + expiration         = (known after apply)
      + has_expired        = (known after apply)
      + id                 = (known after apply)
      + key                = (sensitive value)
      + name               = "grafana-operator"
      + service_account_id = (known after apply)
    }

  # module.infra-resources.azapi_resource.cert_manager will be created
  + resource "azapi_resource" "cert_manager" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + cert-manager = {
                      + force                  = false
                      + path                   = "./"
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring2"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/cert-manager"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + name                      = "cert-manager"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.infra-resources.azapi_resource.container_runtime_aks_config will be created
  + resource "azapi_resource" "container_runtime_aks_config" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + aks-config-ama            = {
                      + force                  = false
                      + path                   = "./ama/"
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                  + aks-config-metrics-server = {
                      + force                  = false
                      + path                   = "./metrics-server/"
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring2"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/container-runtime-aks-config"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + name                      = "container-runtime-aks-config"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.infra-resources.azapi_resource.dis_identity_operator[0] will be created
  + resource "azapi_resource" "dis_identity_operator" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + dis-identity = {
                      + force                  = false
                      + path                   = "./"
                      + postBuild              = {
                          + substitute = {
                              + DISID_ISSUER_URL            = (known after apply)
                              + DISID_TARGET_RESOURCE_GROUP = (known after apply)
                            }
                        }
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring2"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/dis-identity"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = (known after apply)
      + name                      = "dis-identity"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + tags                      = (known after apply)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.infra-resources.azapi_resource.eso will be created
  + resource "azapi_resource" "eso" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + external-secrets-operator = {
                      + force                  = false
                      + path                   = "./"
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring2"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/external-secrets-operator"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + name                      = "external-secrets-operator"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.infra-resources.azapi_resource.flux_syncroot will be created
  + resource "azapi_resource" "flux_syncroot" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + syncroot = {
                      + force                  = false
                      + path                   = "./at22"
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 600
                      + wait                   = true
                    }
                }
              + namespace                  = "corr"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at22"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/corr/syncroot"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = false
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + name                      = "syncroot-corr-at22"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.infra-resources.azapi_resource.grafana_manifests[0] will be created
  + resource "azapi_resource" "grafana_manifests" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + grafana-manifests = {
                      + force                  = false
                      + path                   = "./dashboards/"
                      + postBuild              = {
                          + substitute = {
                              + RELEASE_BRANCH = "release"
                            }
                        }
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring2"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/grafana-manifests"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + name                      = "grafana-manifests"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.infra-resources.azapi_resource.grafana_operator[0] will be created
  + resource "azapi_resource" "grafana_operator" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + grafana-operator             = {
                      + force                  = false
                      + path                   = "./"
                      + postBuild              = {
                          + substitute = {
                              + GRAFANA_ADMIN_APIKEY = (sensitive value)
                            }
                        }
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                  + grafana-operator-post-deploy = {
                      + dependsOn              = [
                          + "grafana-operator",
                        ]
                      + force                  = false
                      + path                   = "./post-deploy/"
                      + postBuild              = {
                          + substitute = {
                              + EXTERNAL_GRAFANA_URL = (known after apply)
                            }
                        }
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring2"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/grafana-operator"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = (known after apply)
      + name                      = "grafana-operator"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + tags                      = (known after apply)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.infra-resources.azapi_resource.linkerd will be created
  + resource "azapi_resource" "linkerd" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + linkerd             = {
                      + force                  = false
                      + path                   = "./"
                      + postBuild              = {
                          + substitute = {
                              + DISABLE_IPV6 = "false"
                            }
                        }
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 600
                      + wait                   = true
                    }
                  + linkerd-post-deploy = {
                      + dependsOn              = [
                          + "linkerd",
                        ]
                      + force                  = true
                      + path                   = "./post-deploy/"
                      + prune                  = true
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 31557600
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring2"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/linkerd"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + name                      = "linkerd"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.infra-resources.azapi_resource.otel_collector will be created
  + resource "azapi_resource" "otel_collector" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + otel-collector = {
                      + force                  = false
                      + path                   = "./"
                      + postBuild              = {
                          + substitute = {
                              + CLIENT_ID = (sensitive value)
                              + KV_URI    = (sensitive value)
                              + TENANT_ID = (sensitive value)
                            }
                        }
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring2"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/otel-collector"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = (known after apply)
      + name                      = "otel-collector"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + tags                      = (known after apply)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.infra-resources.azapi_resource.otel_operator will be created
  + resource "azapi_resource" "otel_operator" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + otel-operator = {
                      + force                  = false
                      + path                   = "./"
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring2"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/otel-operator"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + name                      = "otel-operator"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.infra-resources.azapi_resource.traefik will be created
  + resource "azapi_resource" "traefik" {
      + body                      = {
          + properties = {
              + kustomizations             = {
                  + traefik = {
                      + force                  = false
                      + path                   = "./"
                      + postBuild              = {
                          + substitute = {
                              + AKS_NODE_RG              = (known after apply)
                              + AKS_SYSP00L_IP_PREFIX_0  = "fd96:20bf:3235:1::/64"
                              + AKS_SYSP00L_IP_PREFIX_1  = "10.203.1.0/24"
                              + AKS_WORKPOOL_IP_PREFIX_0 = "fd96:20bf:3235:2::/64"
                              + AKS_WORKPOOL_IP_PREFIX_1 = "10.203.2.0/24"
                              + PUBLIC_IP_V4             = (known after apply)
                              + PUBLIC_IP_V6             = (known after apply)
                            }
                        }
                      + prune                  = false
                      + retryIntervalInSeconds = 300
                      + syncIntervalInSeconds  = 300
                      + timeoutInSeconds       = 300
                      + wait                   = true
                    }
                }
              + namespace                  = "flux-system"
              + ociRepository              = {
                  + insecure              = false
                  + repositoryRef         = {
                      + tag = "at_ring2"
                    }
                  + syncIntervalInSeconds = 300
                  + timeoutInSeconds      = 300
                  + url                   = "oci://altinncr.azurecr.io/manifests/infra/traefik"
                  + useWorkloadIdentity   = true
                }
              + reconciliationWaitDuration = "PT5M"
              + sourceKind                 = "OCIRepository"
              + waitForReconciliation      = true
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = (known after apply)
      + name                      = "traefik"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + tags                      = (known after apply)
      + type                      = "Microsoft.KubernetesConfiguration/fluxConfigurations@2024-11-01"
    }

  # module.observability.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.observability.azuread_application_federated_identity_credential.lakmus_fed_identity will be updated in-place
  ~ resource "azuread_application_federated_identity_credential" "lakmus_fed_identity" {
        id             = "eb131ac3-cb39-4ffc-bdbd-3c3d7f8a5f48/federatedIdentityCredential/1fb32a94-003f-4e22-b35b-92304b98ecc6"
      ~ issuer         = "https://norwayeast.oic.prod-aks.azure.com/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/fdadcd39-4643-46c0-a3f4-34d0e7a7c6f2/" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.observability.azuread_application_federated_identity_credential.obs_fed_identity will be updated in-place
  ~ resource "azuread_application_federated_identity_credential" "obs_fed_identity" {
        id             = "504510f1-a21f-4501-b61f-3297ee583e93/federatedIdentityCredential/46b8f481-c843-4856-a4fd-e9c08e71f94d"
      ~ issuer         = "https://norwayeast.oic.prod-aks.azure.com/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/fdadcd39-4643-46c0-a3f4-34d0e7a7c6f2/" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.observability.azurerm_application_insights.obs will be created
  + resource "azurerm_application_insights" "obs" {
      + app_id                              = (known after apply)
      + application_type                    = "web"
      + connection_string                   = (sensitive value)
      + daily_data_cap_in_gb                = 100
      + disable_ip_masking                  = false
      + force_customer_storage_for_profiler = false
      + id                                  = (known after apply)
      + instrumentation_key                 = (sensitive value)
      + internet_ingestion_enabled          = true
      + internet_query_enabled              = true
      + local_authentication_disabled       = false
      + location                            = "norwayeast"
      + name                                = "corr-at22-obs-appinsights"
      + resource_group_name                 = "corr-at22-obs-rg"
      + retention_in_days                   = 30
      + sampling_percentage                 = 100
      + workspace_id                        = (known after apply)
    }

  # module.observability.azurerm_key_vault.obs_kv will be created
  + resource "azurerm_key_vault" "obs_kv" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = true
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "obs-corr-at22-B5W6pl"
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + resource_group_name           = "corr-at22-obs-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tenant_id                     = (sensitive value)
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls (known after apply)
    }

  # module.observability.azurerm_key_vault_secret.conn_string will be created
  + resource "azurerm_key_vault_secret" "conn_string" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "connectionString"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.observability.azurerm_log_analytics_workspace.obs will be created
  + resource "azurerm_log_analytics_workspace" "obs" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = (known after apply)
      + local_authentication_enabled    = (known after apply)
      + location                        = "norwayeast"
      + name                            = "corr-at22-obs-law"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "corr-at22-obs-rg"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = (known after apply)
      + workspace_id                    = (known after apply)
    }

  # module.observability.azurerm_monitor_data_collection_endpoint.amw[0] will be created
  + resource "azurerm_monitor_data_collection_endpoint" "amw" {
      + configuration_access_endpoint = (known after apply)
      + id                            = (known after apply)
      + immutable_id                  = (known after apply)
      + kind                          = "Linux"
      + location                      = "norwayeast"
      + logs_ingestion_endpoint       = (known after apply)
      + metrics_ingestion_endpoint    = (known after apply)
      + name                          = "corr-at22-obs-amw-mdce"
      + public_network_access_enabled = true
      + resource_group_name           = "corr-at22-obs-rg"
    }

  # module.observability.azurerm_monitor_data_collection_rule.amw[0] will be created
  + resource "azurerm_monitor_data_collection_rule" "amw" {
      + data_collection_endpoint_id = (known after apply)
      + description                 = "DCR for Azure Monitor Metrics Profile (Managed Prometheus)"
      + id                          = (known after apply)
      + immutable_id                = (known after apply)
      + kind                        = "Linux"
      + location                    = "norwayeast"
      + name                        = "corr-at22-obs-amw-mdcr"
      + resource_group_name         = "corr-at22-obs-rg"

      + data_flow {
          + destinations = [
              + "corr-at22-obs-amw",
            ]
          + streams      = [
              + "Microsoft-PrometheusMetrics",
            ]
        }

      + data_sources {
          + prometheus_forwarder {
              + name    = "PrometheusDataSource"
              + streams = [
                  + "Microsoft-PrometheusMetrics",
                ]
            }
        }

      + destinations {
          + monitor_account {
              + monitor_account_id = (known after apply)
              + name               = "corr-at22-obs-amw"
            }
        }
    }

  # module.observability.azurerm_monitor_data_collection_rule_association.amw[0] will be created
  + resource "azurerm_monitor_data_collection_rule_association" "amw" {
      + data_collection_rule_id = (known after apply)
      + description             = "Association of data collection rule. Deleting this association will break the data collection for this AKS Cluster."
      + id                      = (known after apply)
      + name                    = "corr-at22-obs-amw-mdcra"
      + target_resource_id      = (known after apply)
    }

  # module.observability.azurerm_monitor_workspace.obs will be created
  + resource "azurerm_monitor_workspace" "obs" {
      + default_data_collection_endpoint_id = (known after apply)
      + default_data_collection_rule_id     = (known after apply)
      + id                                  = (known after apply)
      + location                            = "norwayeast"
      + name                                = "corr-at22-obs-amw"
      + public_network_access_enabled       = true
      + query_endpoint                      = (known after apply)
      + resource_group_name                 = "corr-at22-obs-rg"
    }

  # module.observability.azurerm_resource_group.obs will be created
  + resource "azurerm_resource_group" "obs" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "corr-at22-obs-rg"
    }

  # module.observability.azurerm_role_assignment.ci_kv_secrets_role will be created
  + resource "azurerm_role_assignment" "ci_kv_secrets_role" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # module.observability.azurerm_role_assignment.kv_reader_lakmus must be replaced
-/+ resource "azurerm_role_assignment" "kv_reader_lakmus" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/providers/Microsoft.Authorization/roleAssignments/8e375ea5-008b-1469-8438-7a14841f1db8" -> (known after apply)
      ~ name                                   = "8e375ea5-008b-1469-8438-7a14841f1db8" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8/providers/Microsoft.Authorization/roleDefinitions/21090545-7ca7-4776-b22c-e363652d74d2" -> (known after apply)
      ~ scope                                  = "/subscriptions/cc6b5886-36af-4d54-9d30-1b0fffc736d8" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.observability.azurerm_role_assignment.obs_kv_reader will be created
  + resource "azurerm_role_assignment" "obs_kv_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "567854d0-dfd5-4ed9-a281-dbb80caa9dbd"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

Plan: 58 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @tjololo |
| Action | `pull_request` |
| Working Directory | `./infrastructure/altinn-correspondence-test/corr-at22-aks-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/corr-at22-aks-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_corr-at22-aks-rg.tfstate.tfplan` |